#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

confluent_service_account.app-manager-PROD-Kafka: Refreshing state... [id=sa-nrzjg3]
confluent_service_account.Email-Service_PROD-Kafka: Refreshing state... [id=sa-rvy837]
confluent_service_account.Orders-Service---Validations-Aggregator_PROD-Kafka: Refreshing state... [id=sa-g1go8v]
data.confluent_schema_registry_region.essentials: Reading...
confluent_service_account.Catalogue-Filter-View-kSQL_PROD-Kafka: Refreshing state... [id=sa-9518n0]
confluent_service_account.Order-Details-Service_PROD-Kafka: Refreshing state... [id=sa-oz0rpp]
confluent_environment.PROD-Kafka: Refreshing state... [id=env-kgqz5p]
confluent_service_account.Catalogue-Services_PROD-Kafka: Refreshing state... [id=sa-qzm0xd]
confluent_service_account.Basket-Service---Basket-Writer-REST-proxy_PROD-Kafka: Refreshing state... [id=sa-25mzo2]
confluent_service_account.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka: Refreshing state... [id=sa-v83d0j]
data.confluent_schema_registry_region.essentials: Read complete after 1s [id=sgreg-1]
confluent_service_account.Orders-Service---Orders-View_PROD-Kafka: Refreshing state... [id=sa-158px3]
confluent_service_account.Orders-Service----Order-Writer_PROD-Kafka: Refreshing state... [id=sa-x61d31]
confluent_service_account.Fraud-Service_PROD-Kafka: Refreshing state... [id=sa-pw82v2]
confluent_service_account.Inventory-Service_PROD-Kafka: Refreshing state... [id=sa-7k328j]
confluent_service_account.Basket-Service---Basket-View-kSQL_PROD-Kafka: Refreshing state... [id=sa-jzxp1q]
confluent_schema_registry_cluster.essentials-PROD-Kafka: Refreshing state... [id=lsrc-pk2d5o]
confluent_kafka_cluster.cluster-PROD-Kafka: Refreshing state... [id=lkc-gkodx3]
confluent_api_key.Orders-Service---Orders-View_PROD-Kafka: Refreshing state... [id=IUMNL7XLYZHN2XCG]
confluent_role_binding.app-manager-kafka-cluster-admin-PROD-Kafka: Refreshing state... [id=rb-jojdY]
confluent_api_key.Order-Details-Service_PROD-Kafka: Refreshing state... [id=L75N4SWPZ74MSY3L]
confluent_api_key.Catalogue-Services_PROD-Kafka: Refreshing state... [id=WE6TILEGAUGQNAJS]
confluent_api_key.Inventory-Service_PROD-Kafka: Refreshing state... [id=DOOOPI557EP3Q75V]
confluent_api_key.Basket-Service---Basket-Writer-REST-proxy_PROD-Kafka: Refreshing state... [id=BLXGBI7T4VFFOVMN]
confluent_api_key.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka: Refreshing state... [id=FBGFWZHCQJ5BBMGV]
confluent_api_key.Fraud-Service_PROD-Kafka: Refreshing state... [id=C3YVKCQAMSS7OOIJ]
confluent_api_key.Orders-Service----Order-Writer_PROD-Kafka: Refreshing state... [id=36EM4CEDF36KR5LD]
confluent_api_key.Catalogue-Filter-View-kSQL_PROD-Kafka: Refreshing state... [id=YZKTCP7FMWYSAWHY]
confluent_api_key.Email-Service_PROD-Kafka: Refreshing state... [id=VQ7LWG4K2CVIKWKK]
confluent_api_key.Basket-Service---Basket-View-kSQL_PROD-Kafka: Refreshing state... [id=74YFSOL3QMCARLJY]
confluent_api_key.Orders-Service---Validations-Aggregator_PROD-Kafka: Refreshing state... [id=D77KZTKT4EQCMZAL]
confluent_api_key.app-manager-PROD-Kafka-kafka-api-key: Refreshing state... [id=WPFCDDN4FQWFTW5K]
confluent_kafka_acl.Email-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-rvy837#*#READ#ALLOW]
confluent_kafka_acl.Inventory-Service_PROD-Kafka_Write_warehouse-inventory: Refreshing state... [id=lkc-gkodx3/TOPIC#warehouse-inventory#LITERAL#User:sa-7k328j#*#WRITE#ALLOW]
confluent_kafka_acl.Fraud-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-pw82v2#*#READ#ALLOW]
confluent_kafka_topic.basket: Refreshing state... [id=lkc-gkodx3/basket]
confluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_basket: Refreshing state... [id=lkc-gkodx3/TOPIC#basket#LITERAL#User:sa-jzxp1q#*#READ#ALLOW]
confluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_customers_group: Refreshing state... [id=lkc-gkodx3/GROUP#customers#LITERAL#User:sa-jzxp1q#*#READ#ALLOW]
confluent_kafka_acl.Fraud-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-pw82v2#*#READ#ALLOW]
confluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_warehouse-inventory: Refreshing state... [id=lkc-gkodx3/TOPIC#warehouse-inventory#LITERAL#User:sa-7k328j#*#READ#ALLOW]
confluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_warehouse-inventory_group: Refreshing state... [id=lkc-gkodx3/GROUP#warehouse-inventory#LITERAL#User:sa-7k328j#*#READ#ALLOW]
confluent_kafka_acl.Orders-Service---Validations-Aggregator_PROD-Kafka_Write_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-g1go8v#*#WRITE#ALLOW]
confluent_kafka_acl.Catalogue-Services_PROD-Kafka_Write_catalogue: Refreshing state... [id=lkc-gkodx3/TOPIC#catalogue#LITERAL#User:sa-qzm0xd#*#WRITE#ALLOW]
confluent_kafka_acl.Orders-Service---Validations-Aggregator_PROD-Kafka_Read_order-validations_group: Refreshing state... [id=lkc-gkodx3/GROUP#order-validations#LITERAL#User:sa-g1go8v#*#READ#ALLOW]
confluent_kafka_acl.Order-Details-Service_PROD-Kafka_Write_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-oz0rpp#*#WRITE#ALLOW]
confluent_kafka_acl.Orders-Service----Order-Writer_PROD-Kafka_Write_payments: Refreshing state... [id=lkc-gkodx3/TOPIC#payments#LITERAL#User:sa-x61d31#*#WRITE#ALLOW]
confluent_kafka_acl.Orders-Service----Order-Writer_PROD-Kafka_Write_customers: Refreshing state... [id=lkc-gkodx3/TOPIC#customers#LITERAL#User:sa-x61d31#*#WRITE#ALLOW]
confluent_kafka_acl.Order-Details-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-oz0rpp#*#READ#ALLOW]
confluent_kafka_acl.Email-Service_PROD-Kafka_Read_payments_group: Refreshing state... [id=lkc-gkodx3/GROUP#payments#LITERAL#User:sa-rvy837#*#READ#ALLOW]
confluent_kafka_acl.Email-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-rvy837#*#READ#ALLOW]
confluent_kafka_acl.Email-Service_PROD-Kafka_Read_customers: Refreshing state... [id=lkc-gkodx3/TOPIC#customers#LITERAL#User:sa-rvy837#*#READ#ALLOW]
confluent_kafka_acl.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka_Read_catalogue_group: Refreshing state... [id=lkc-gkodx3/GROUP#catalogue#LITERAL#User:sa-v83d0j#*#READ#ALLOW]
confluent_kafka_acl.Basket-Service---Basket-Writer-REST-proxy_PROD-Kafka_Write_basket: Refreshing state... [id=lkc-gkodx3/TOPIC#basket#LITERAL#User:sa-25mzo2#*#WRITE#ALLOW]
confluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_warehouse-inventory: Refreshing state... [id=lkc-gkodx3/TOPIC#warehouse-inventory#LITERAL#User:sa-9518n0#*#READ#ALLOW]
confluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_catalogue: Refreshing state... [id=lkc-gkodx3/TOPIC#catalogue#LITERAL#User:sa-9518n0#*#READ#ALLOW]
confluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-7k328j#*#READ#ALLOW]
confluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_catalogue_group: Refreshing state... [id=lkc-gkodx3/GROUP#catalogue#LITERAL#User:sa-9518n0#*#READ#ALLOW]
confluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_basket_group: Refreshing state... [id=lkc-gkodx3/GROUP#basket#LITERAL#User:sa-jzxp1q#*#READ#ALLOW]
confluent_kafka_topic.order-validations: Refreshing state... [id=lkc-gkodx3/order-validations]
confluent_kafka_acl.Orders-Service---Orders-View_PROD-Kafka_Read_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-158px3#*#READ#ALLOW]
confluent_kafka_topic.warehouse-inventory: Refreshing state... [id=lkc-gkodx3/warehouse-inventory]
confluent_kafka_acl.Catalogue-Filter-View-kSQL_PROD-Kafka_Read_warehouse-inventory_group: Refreshing state... [id=lkc-gkodx3/GROUP#warehouse-inventory#LITERAL#User:sa-9518n0#*#READ#ALLOW]
confluent_kafka_acl.Fraud-Service_PROD-Kafka_Write_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-pw82v2#*#WRITE#ALLOW]
confluent_kafka_acl.Orders-Service----Order-Writer_PROD-Kafka_Write_orders: Refreshing state... [id=lkc-gkodx3/TOPIC#orders#LITERAL#User:sa-x61d31#*#WRITE#ALLOW]
confluent_kafka_topic.customers: Refreshing state... [id=lkc-gkodx3/customers]
confluent_kafka_acl.Orders-Service---Validations-Aggregator_PROD-Kafka_Read_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-g1go8v#*#READ#ALLOW]
confluent_kafka_acl.Email-Service_PROD-Kafka_Read_customers_group: Refreshing state... [id=lkc-gkodx3/GROUP#customers#LITERAL#User:sa-rvy837#*#READ#ALLOW]
confluent_kafka_acl.Inventory-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-7k328j#*#READ#ALLOW]
confluent_kafka_acl.Inventory-Service_PROD-Kafka_Write_order-validations: Refreshing state... [id=lkc-gkodx3/TOPIC#order-validations#LITERAL#User:sa-7k328j#*#WRITE#ALLOW]
confluent_kafka_topic.orders: Refreshing state... [id=lkc-gkodx3/orders]
confluent_kafka_acl.Order-Details-Service_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-oz0rpp#*#READ#ALLOW]
confluent_kafka_topic.payments: Refreshing state... [id=lkc-gkodx3/payments]
confluent_kafka_topic.catalogue: Refreshing state... [id=lkc-gkodx3/catalogue]
confluent_kafka_acl.Catalogue-Search-Kafka-Connect---Elasticsearch_PROD-Kafka_Read_catalogue: Refreshing state... [id=lkc-gkodx3/TOPIC#catalogue#LITERAL#User:sa-v83d0j#*#READ#ALLOW]
confluent_kafka_acl.Email-Service_PROD-Kafka_Read_payments: Refreshing state... [id=lkc-gkodx3/TOPIC#payments#LITERAL#User:sa-rvy837#*#READ#ALLOW]
confluent_kafka_acl.Basket-Service---Basket-View-kSQL_PROD-Kafka_Read_customers: Refreshing state... [id=lkc-gkodx3/TOPIC#customers#LITERAL#User:sa-jzxp1q#*#READ#ALLOW]
confluent_kafka_acl.Orders-Service---Orders-View_PROD-Kafka_Read_orders_group: Refreshing state... [id=lkc-gkodx3/GROUP#orders#LITERAL#User:sa-158px3#*#READ#ALLOW]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_api_key.Shipping-Service_PROD-Kafka will be created
  + resource "confluent_api_key" "Shipping-Service_PROD-Kafka" {
      + description            = "Kafka API Key that is owned by Shipping-Service service account"
      + disable_wait_for_ready = false
      + display_name           = "Shipping-Service_PROD-Kafka"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = "cmk/v2"
          + id          = "lkc-gkodx3"
          + kind        = "Cluster"

          + environment {
              + id = "env-kgqz5p"
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_catalogue will be created
  + resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_catalogue" {
      + host          = "*"
      + id            = (known after apply)
      + operation     = "READ"
      + pattern_type  = "LITERAL"
      + permission    = "ALLOW"
      + principal     = (known after apply)
      + resource_name = "catalogue"
      + resource_type = "TOPIC"
    }

  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_catalogue_group will be created
  + resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_catalogue_group" {
      + host          = "*"
      + id            = (known after apply)
      + operation     = "READ"
      + pattern_type  = "LITERAL"
      + permission    = "ALLOW"
      + principal     = (known after apply)
      + resource_name = "catalogue"
      + resource_type = "GROUP"
    }

  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_customers will be created
  + resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_customers" {
      + host          = "*"
      + id            = (known after apply)
      + operation     = "READ"
      + pattern_type  = "LITERAL"
      + permission    = "ALLOW"
      + principal     = (known after apply)
      + resource_name = "customers"
      + resource_type = "TOPIC"
    }

  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Read_customers_group will be created
  + resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Read_customers_group" {
      + host          = "*"
      + id            = (known after apply)
      + operation     = "READ"
      + pattern_type  = "LITERAL"
      + permission    = "ALLOW"
      + principal     = (known after apply)
      + resource_name = "customers"
      + resource_type = "GROUP"
    }

  # confluent_kafka_acl.Shipping-Service_PROD-Kafka_Write_shipping will be created
  + resource "confluent_kafka_acl" "Shipping-Service_PROD-Kafka_Write_shipping" {
      + host          = "*"
      + id            = (known after apply)
      + operation     = "WRITE"
      + pattern_type  = "LITERAL"
      + permission    = "ALLOW"
      + principal     = (known after apply)
      + resource_name = "shipping"
      + resource_type = "TOPIC"
    }

  # confluent_kafka_topic.shipping will be created
  + resource "confluent_kafka_topic" "shipping" {
      + config           = {
          + "cleanup.policy"                      = "delete"
          + "compression.type"                    = "producer"
          + "delete.retention.ms"                 = "86400000"
          + "file.delete.delay.ms"                = "60000"
          + "flush.messages"                      = "9223372036854775807"
          + "flush.ms"                            = "9223372036854775807"
          + "index.interval.bytes"                = "4096"
          + "max.compaction.lag.ms"               = "9223372036854775807"
          + "max.message.bytes"                   = "2097164"
          + "message.downconversion.enable"       = "true"
          + "message.format.version"              = "3.0-IV1"
          + "message.timestamp.difference.max.ms" = "9223372036854775807"
          + "message.timestamp.type"              = "CreateTime"
          + "min.cleanable.dirty.ratio"           = "0.5"
          + "min.insync.replicas"                 = "2"
          + "retention.bytes"                     = "-1"
          + "retention.ms"                        = "604800000"
          + "segment.bytes"                       = "104857600"
          + "segment.index.bytes"                 = "10485760"
          + "segment.ms"                          = "604800000"
        }
      + id               = (known after apply)
      + partitions_count = 6
      + topic_name       = "shipping"
    }

  # confluent_service_account.Shipping-Service_PROD-Kafka will be created
  + resource "confluent_service_account" "Shipping-Service_PROD-Kafka" {
      + api_version  = (known after apply)
      + description  = "Service account to manage 'PROD-Kafka' Kafka cluster"
      + display_name = "Shipping-Service-PROD-Kafka"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @TamimiGitHub, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*